{
  "navBar": ["O mně", "Moje projekty", "Odkazy", "Kontakt"],
  "aboutMe": {
    "title": "Martin Šotnar",
    "paragraphs": [
      "Ahoj, jmenuji se Martin, jsem IT nadšenec a zaměřuji se na vývoj frontendu. Mám za sebou několik online kurzů HTML, CSS, responzivního design, Gitu, JavaScriptu, Reactu a dalších technologií. Tyto kurzy jsem si prošel sám, bez lektora. Mám za sebou ale i akreditovaný kurz JS Academy od Skillmea s lektorem, ukončený závěrečnou zkouškou.",
      "Mimo jiné mám zkušenosti s backendovým jazykem Node.js a jeho frameworkem Express, databází SQLite a frameworkem Electron.js, které jsem použil v jednom z mých zatím největších projektů FlavorLog (viz sekce Projekty).",
      "Aktuálně se věnuji vývoji slovní hry hangman, neboli českého oběšence. Hru tvořím v Reactu a učím se na ní také typování pomocí TypeScriptu a práci s routami pomocí React Router. Zároveň ale začínám pracovat na dalším, opět herním, skupinovém projektu, který bude vytvořen také na kombinaci React + TypeScript. Více infa přidám brzy.",
      "V budoucnu mám dále naplánovaný ještě jeden větší projekt, který bude mířit na zaměstnance a jejich práva, benefity a povinnosti. Chtěl bych na něm dál rozvíjet React a TypeScript a naučit se pracovat s Tailwindem.",
      "<span>Můj tech. stack:</span> HTML, CSS, GIT, JavaScript, React, TypeScript",
      "<span>Setkal jsem se s:</span> Node.js, Express, SQLite, Electron"
    ]
  },
  "myProjects": {
    "title": "Moje projekty",
    "projects": [
      {
        "title": "Portfolio",
        "description": "Toto je vůbec můj první frontendový projekt, najdete zde něco o mně, nějaké moje další projekty, popřípadě kontakt na mě. Na této stránce se snažím co nejvíc vyřádit a vyzkoušet to, co jsem se naučil, popř. si na ní zkoušet nové věci.",
        "playButton": "Otevři",
        "codeButton": "Kód"
      },
      {
        "title": "Mini hra",
        "description": "Tuto hru jsem vytvořil v rámci JS Academy. Jedná se o jednoduchou klikačku, kde se zvedá skóré za každou trefenou kostičku. Když kostka spadne na zem, hra končí.",
        "playButton": "Spusť",
        "codeButton": "Kód"
      },
      {
        "title": "Flavor Log",
        "description": "Toto je můj první projekt psaný v Reactu a taky jsem si na něm poprvé vyzkoušel udělat celý CRUD. Je to moje verze osobního receptáře, kam si můžete nahrát recepty, které se uloží do SQLite databáze, z které je můžete pomocí vyhledávání nebo filtrů znovu vytáhnout. Vše podstatné by mělo být funkční, stále však pracuji na doladění UX a přidání nějakých feature.",
        "playButton": "Stáhni",
        "codeButton": "Kód"
      },
      {
        "title": "Hangman",
        "description": "Hangman je hra, ve které hádáte písmena a snažíte se z nich vytvořit slovo. Za každé neuhodnuté písmeno se ale postaví kus šibenice. Pokud uhodnete slovo, než se šibenice dostaví, vyhráli jste. Na tomto projektu jsem si poprvé vyzkoušel práci s routami v reactu a hlavně typování pomocí TypeScriptu.",
        "playButton": "Otevři",
        "codeButton": "Kód"
      }
    ]
  },
  "links": {
    "title": "Odkazy"
  },
  "contacts": {
    "title": "Kontakt",
    "name": "Martin Šotnar"
  }
}
