{
  "navBar": ["About me", "My projects", "Links", "Contacts"],
  "aboutMe": {
    "title": "Martin Sotnar",
    "paragraphs": [
      "Hello, my name is Martin and I am an IT enthusiast and front-end developer \"wanna be\". I have completed several HTML, CSS, responsive design, GIT, JavaScript, React and a few other online courses. I have studied most of the courses on my own (without a lecturer). However, I have done the JS Academy course from Skillmea (with a lecturer) as well, finished by passing the final exam.",
      "I am focusing on writing this website and also, so far my biggest project, Flavor Log (check <a class='flavorLogLink' href='#flavorLog'>Projects</a> section), where I am learning a JavaScript framework React and also working with Node.js and its framework Express. I have come across SQLite and Electron.js too, while working on Flavor Log. I would like to learn TypeScript and React routes on a small project in near future.",
      "<span>My tech. stack:</span> HTML, CSS, GIT, JavaScript, React",
      "<span>A few experience with:</span> Node.js, Express, SQLite, Electron"
    ]
  },
  "myProjects": {
    "title": "My projects",
    "projects": [
      {
        "title": "Portfolio",
        "description": "This is my very first FE project, you can find something about me here, a few of my other projects, or my contact. I am trying to use everything I've learned on this website, also trying to learn new things on it.",
        "playButton": "Visit",
        "codeButton": "Code"
      },
      {
        "title": "Minigame",
        "description": "I created this game while doing a JS Academy course. This is a simple clicking game, where the score goes up for every target hit with your mouse. When the cube drops, the game ends.",
        "playButton": "Play",
        "codeButton": "Code"
      },
      {
        "title": "Flavor Log",
        "description": "This is my first full CRUD React project. It is my version of a personal recipe book, where you can store recipes in an SQLite database. You can use search or filters to get to them later. Every important aspect should work properly but I am still working on some UX updates/fixes and adding more features.",
        "playButton": "Get",
        "codeButton": "Code"
      }
    ]
  },
  "links": {
    "title": "Links"
  },
  "contacts": {
    "title": "Contacts",
    "name": "Martin Sotnar"
  }
}
