{
  "navBar": ["About me", "My projects", "Links", "Contacts"],
  "aboutMe": {
    "title": "Martin Sotnar",
    "paragraphs": [
      "Hello, my name is Martin and I am an IT enthusiast with a focus on frontend development.I have completed several online courses covering HTML, CSS, responsive design, Git, JavaScript, React, and other technologies. I have studied most of the courses on my own (without a lecturer). However, I have completed the JS Academy course from Skillmea (with a lecturer) as well, finished by passing the final exam.",
      "I also have experience with the backend language Node.js and its framework Express, the SQLite database, and the Electron.js framework, which I used in one of my largest projects so far, FlavorLog (see the <a class='flavor-log-link' href='#flavor-log'>Projects</a> section).",
      "Currently, I am working on a word game called Hangman. I am building the game in React and using it to learn TypeScript typing as well as routing with React Router. At the same time, I am starting to work on another game project, also built on React + TypeScript, this time it's group project. More information will be added soon.",
      "In the future, I am planning another larger project focused on employees and their rights, benefits, and responsibilities. I would like to further develop my skills in React and TypeScript and learn to work with Tailwind on this project.",
      "<span>My tech. stack:</span> HTML, CSS, GIT, JavaScript, React, TypeScript",
      "<span>A few experience with:</span> Node.js, Express, SQLite, Electron"
    ]
  },
  "myProjects": {
    "title": "My projects",
    "projects": [
      {
        "title": "Portfolio",
        "description": "This is my very first FE project, you can find something about me here, a few of my other projects, or my contact. I am trying to use everything I've learned on this website, also trying to learn new things on it.",
        "playButton": "Visit",
        "codeButton": "Code"
      },
      {
        "title": "Minigame",
        "description": "I created this game while doing a JS Academy course. This is a simple clicking game, where the score goes up for every target hit with your mouse. When the cube drops, the game ends.",
        "playButton": "Play",
        "codeButton": "Code"
      },
      {
        "title": "Flavor Log",
        "description": "This is my first full CRUD React project. It is my version of a personal recipe book, where you can store recipes in an SQLite database. You can use search or filters to get to them later. Every important aspect should work properly but I am still working on some UX updates/fixes and adding more features.",
        "playButton": "Get",
        "codeButton": "Code"
      }
    ]
  },
  "links": {
    "title": "Links"
  },
  "contacts": {
    "title": "Contacts",
    "name": "Martin Sotnar"
  }
}
